<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of Cisco Jabber from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.sysco.pkg.CiscoJabber</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cisco Jabber</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.sysco.download.ciscojabber</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%found_filename%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/extractedfile</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
