<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of the Microsoft Edge installer package and installs it.</string>
      <key>Identifier</key>
      <string>com.github.sysco.install.microsoftedge</string>
      <key>Input</key>
      <dict>
          <key>NAME</key>
          <string>Microsoft Edge</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.sysco.pkg.microsoftedge</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>Installer</string>
         </dict>
      </array>
   </dict>
</plist>