<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates a Cisco AnyConnect VPN-only package.</string>
    <key>Identifier</key>
    <string>com.github.sysco.recipes.pkg.CiscoAnyConnect</string>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cisco AnyConnect Secure Mobility Client</string>
        <key>VPN_XML</key>
        <string>Employee_1.0.xml</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PackageRequired</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>Profiles</key>
                    <string>0755</string>
                    <key>Profiles/vpn</key>
                    <string>0755</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/AnyConnect.pkg</string>
                <key>source_pkg</key>
                <string>%PKG%/AnyConnect.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/AnyConnect.pkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Payload</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/vpn_module.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/Payload/Applications/Cisco/Cisco AnyConnect Secure Mobility Client.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <dict>
                <key>choices_pkg_path</key>
                <string>%pkg_path%</string>
                <key>choices_xml_dest</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/choices.xml</string>
                <key>desired_choices</key>
                <array>
                    <string>choice_vpn</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/Profiles/vpn/%VPN_XML%</string>
                <key>source_path</key>
                <string>%RECIPE_DIR%/%VPN_XML%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>
                    #!/bin/bash
                    ## script to install and activate Cisco AnyConnect

                    DIR=$(dirname "$0")

                    /usr/sbin/installer -applyChoiceChangesXML "$DIR/choices.xml" -pkg "$DIR/AnyConnect.pkg" -target /

                    if [ $? -eq 0 ]; then
                        echo "Cisco AnyConnect installed."
                    else
                        echo "ERROR: Cisco AnyConnect installation failed."
                        exit 1
                    fi
                </string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array/>
                    <key>id</key>
                    <string>ch.ethz.id.pkg.CiscoAnyConnect</string>
                    <key>pkgname</key>
                    <string>CiscoAnyConnect-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>installer_choices_xml</key>
		<array>
			<dict>
				<key>attributeSetting</key>
				<integer>1</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_vpn</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_fireamp</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_dart</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_posture</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_iseposture</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_nvm</string>
			</dict>
			<dict>
				<key>attributeSetting</key>
				<integer>0</integer>
				<key>choiceAttribute</key>
				<string>selected</string>
				<key>choiceIdentifier</key>
				<string>choice_umbrella</string>
			</dict>
		</array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/AnyConnect.pkg</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/Payload</string>
                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
