<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates a PKG from a specified AnyConnect DMG file.</string>
    <key>Identifier</key>
    <string>com.example.pkg.anyconnect</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>dmg_path</key>
        <string></string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgMounter</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%dmg_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%mount_point%/AnyConnect.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/AnyConnect</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%mount_point%/AnyConnect.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/AnyConnect.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/AnyConnect</string>
                <key>pkgname</key>
                <string>AnyConnect</string>
                <key>version</key>
                <string>%version%</string>
                <key>id</key>
                <string>com.example.pkg.anyconnect</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
