<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.sysco.download.AnyConnect</string>
    <key>Description</key>
    <string>Copies the latest version of Cisco AnyConnect from a network share or folder.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AnyConnect</string>
        <key>SOURCE_PATH</key>
        <string>"/Users/ddal1000/Library/CloudStorage/OneDrive-SyscoCorporation/Documents/Workspace ONE Admin Assistant/AnyConnect-4.10.08029/AnyConnect-4.10.08029.dmg"</string> <!-- Replace with the actual path -->
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%SOURCE_PATH%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Arguments</key>
            <dict/>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>requirement</key>
                <string>identifier "com.cisco.pkg.anyconnect" and anchor apple generic and certificate leaf[subject.OU] = "4U49YY6Q5E"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
