Description: Creates a Cisco AnyConnect VPN-only package.
Identifier: com.github.sysco.recipes.pkg.CiscoAnyConnect
MinimumVersion: "2.3"

Input:
  NAME: Cisco AnyConnect Secure Mobility Client
  VPN_XML: Employee_01.xml

Process:
  - Processor: PackageRequired

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Profiles: "0755"
        Profiles/vpn: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Scripts/AnyConnect.pkg"
      source_pkg: "%PKG%/AnyConnect.pkg"

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%RECIPE_CACHE_DIR%/Scripts/AnyConnect.pkg"
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/vpn_module.pkg/Payload"
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Payload/Applications/Cisco/Cisco AnyConnect Secure Mobility Client.app/Contents/Info.plist"

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
    Arguments:
      choices_pkg_path: "%pkg_path%"
      choices_xml_dest: "%RECIPE_CACHE_DIR%/Scripts/choices.xml"
      desired_choices:
        - choice_vpn

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/Profiles/vpn/%VPN_XML%"
      source_path: "%RECIPE_DIR%/%VPN_XML%"

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash
        ## script to install and activate Cisco AnyConnect

        DIR=$(dirname "$0")

        /usr/sbin/installer -applyChoiceChangesXML "$DIR/choices.xml" -pkg "$DIR/AnyConnect.pkg" -target /

        if (test $? = 0) then
            echo "Cisco AnyConnect installed."
        else
            echo "ERROR: Cisco AnyConnect installation failed."
            exit 1
        fi
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: ch.ethz.id.pkg.CiscoAnyConnect
        pkgname: CiscoAnyConnect-%version%
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/AnyConnect.pkg"
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/Payload"
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"